MusicApp/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "The Arctic Monkeys"], ["updated_at", "2020-04-28 19:33:26.554021"], ["id", 3]]
---
  def update
    @band = Band.find_by(id: params[:id])

    if @band.update_attributes(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 4]]
---
  def destroy
    @band = Band.find_by(id: params[:id])
    @band.destroy