MusicApp/app/models/user.rb

  def reset_session_token!
    self.update!(session_token: User.generate_session_token)
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "0gaH2OpQfKOLs_uWLS5Muw"], ["id", 2]]